package org.androidtown.home;

import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.AutoCompleteTextView;
import android.widget.TextView;
import android.widget.Toast;

public class SettingDes extends AppCompatActivity {
    public static String[] names = new String[]{"교대", "남부터미널", "양재", "매봉", "도곡", "대치", "대청", "일원", "수서", "가락시장", "경찰병원", "오금", "당고개", "상계", "노원", "쌍문", "수유", "미아", "미아사거리", "길음", "한성대입구", "혜화", "동대문", "동대문역사문화공원", "충무로", "명동", "회현", "서울", "삼각지", "신용산", "이촌", "동작", "총신대입구(이수)", "남태령", "남영", "노량진", "영등포", "신도림", "서빙고", "한남", "응봉", "왕십리", "외대앞", "신이문", "석계", "월계", "녹천", "시청", "종각", "종로3가", "종로5가", "신설동", "제기동", "동묘앞", "을지로입구", "을지로3가", "을지로4가", "상왕십리", "한양대", "뚝섬", "건대입구", "구의", "강변", "잠실나루", "신천", "삼성", "선릉", "강남", "서초", "방배", "사당", "서울대입구", "봉천", "신림", "신대방", "구로디지털단지", "문래", "영등포구청", "당산", "홍대입구", "신촌", "이대", "아현", "충정로", "신답", "도림천", "양천구청", "신정네거리", "용두", "까치산", "지축", "구파발", "연신내", "불광", "녹번", "홍제", "무악재", "독립문", "동대입구", "금호", "옥수", "압구정", "신사", "고속터미널", "일산", "탄현", "금릉", "금촌", "파주", "문산", "광운대", "상봉", "망우", "갈매", "별내", "사릉", "금곡", "천마산", "마석", "청평", "상천", "굴봉산", "백양리", "남춘천", "쌍용(나사렛대)", "아산", "탕정", "풍기", "온양온천", "신창", "원당", "백석", "마두", "주엽", "대화", "방화", "개화산", "김포공항", "마곡", "발산", "우장산", "화곡", "신정", "목동", "오목교", "신길", "여의나루", "마포", "공덕", "애오개", "서대문", "광화문", "마포구청", "망원", "합정", "상수", "대흥", "효창공원앞", "이태원", "한강진", "버티고개", "약수", "신당", "창신", "보문", "고려대", "상월곡", "태릉입구", "화랑대", "장암", "도봉산", "수락산", "마들", "청구", "신금호", "행당", "마장", "장한평", "군자", "아차산", "천호", "강동", "길동", "명일", "고덕", "둔촌동", "방이", "개롱", "거여", "응암", "역촌", "구산", "새절", "증산", "대공원", "과천", "인덕원", "평촌", "금정", "가산디지털단지", "관악", "안양", "군포", "성균관대", "화서", "독산", "세류", "세마", "오산대", "오산", "송탄", "서정리", "평택", "직산", "당정", "서동탄", "광명", "산본", "대야미", "상록수", "중앙", "고잔", "안산", "신길온천", "오이도", "수리산", "오류동", "역곡", "송내", "부평", "주안", "제물포", "인천", "구일", "소사", "간석", "도원", "중동", "도화", "수원", "서울숲", "압구정로데오", "선정릉", "가천대", "야탑", "수내", "정자", "오리", "이매", "죽전", "구성", "기흥", "상갈", "영통", "망포", "수원시청", "월곶", "소래포구", "인천논현", "남동인더스파크", "원인재", "연수", "도봉", "회룡", "의정부", "녹양", "양주", "덕계", "지행", "동두천중앙", "소요산", "마전(무정차)", "구룡", "개포동", "대모산입구", "복정", "회기", "중랑", "양원", "구리", "양정", "덕소", "팔당", "운길산", "아신", "오빈", "용문", "대곡", "신촌(경의중앙선)", "서강대", "가좌", "디지털미디어시티", "화전", "행신", "곡산", "백마", "발곡", "범골", "경전철의정부", "의정부시청", "흥선", "의정부중앙", "동오", "새말", "효자", "곤제", "어룡", "탑석", "판교", "원흥", "청량리", "성수", "잠실", "역삼", "낙성대", "대림", "삼동", "경기광주", "초월", "청라국제도시", "언주", "삼성중앙", "봉은사", "종합운동장", "대방", "창동", "봉명", "배방", "구로", "석수", "명학", "의왕", "병점", "진위", "지제", "성환", "천안", "개봉", "부천", "백운", "동인천", "부개", "강매", "온수", "방학", "망월사", "가능", "덕정", "보산", "삼송", "정발산", "성신여대입구", "숙대입구", "선바위", "경마공원", "정부과천청사", "범계", "반월", "한대앞", "초지", "정왕", "송정", "양평", "중계", "하계", "공릉", "중화", "면목", "용마산", "중곡", "뚝섬유원지", "청담", "강남구청", "논현", "반포", "남성", "숭실대입구", "신대방삼거리", "보라매", "남구로", "철산", "광명사거리", "천왕", "부천종합운동장", "춘의", "부천시청", "상동", "삼산체육관", "부평구청", "강동구청", "석촌", "송파", "문정", "장지", "산성", "단대오거리", "신흥", "모란", "계양", "박촌", "임학", "작전", "갈산", "동수", "간석오거리", "인천시청", "예술회관", "문학경기장", "선학", "신연수", "동춘", "동막", "지식정보단지", "인천대입구", "국제업무지구", "개화", "공항시장", "신방화", "마곡나루", "가양", "증미", "등촌", "신목동", "선유도", "여의도", "샛강", "흑석", "구반포", "신반포", "사평", "신논현", "검암", "운서", "인천국제공항", "강남대", "지석", "동백", "초당", "시청·용인대", "명지대", "운동장·송담대", "고진", "둔전", "전대·에버랜드", "태평", "서현", "미금", "보정", "신갈", "청명", "매탄권선", "달월", "호구포", "송도", "먹골", "사가정", "어린이대공원", "학동", "내방", "상도", "신풍", "까치울", "신중동", "굴포천", "몽촌토성", "남한산성입구", "용답", "경복궁", "안국", "잠원", "학여울", "용산", "한티", "신원", "양평(경의중앙선)", "김유정", "금천구청", "두정", "동암", "매교", "동두천", "화정", "영등포시장", "상일동", "월드컵경기장", "월곡", "장승배기", "암사", "테크노파크", "노들", "양재시민의숲", "테스트", "검단오류", "왕길", "검단사거리", "마전", "완정", "독정", "검바위", "아시아드경기장", "서구청", "가정", "가정중앙시장", "석남", "서부여성회관", "인천가좌", "가재울", "주안국가산단", "인하대", "숭의", "신포", "시민공원", "석바위시장", "석천사거리", "모래내시장", "만수", "남동구청", "인천대공원", "운연", "곤지암", "신둔도예촌", "이천", "부발", "세종대왕릉", "여주", "야당", "답십리", "광나루", "굽은다리", "올림픽공원", "마천", "독바위", "광흥창", "녹사평", "안암", "돌곶이", "봉화산", "동천", "수지구청", "성복", "상현", "광교중앙", "광교", "수진", "귤현", "계산", "경인교대입구", "부평시장", "부평삼거리", "인천터미널", "캠퍼스타운", "센트럴파크", "양천향교", "염창", "국회의사당", "공항화물청사", "청계산입구", "어정", "삼가", "김량장", "보평", "경기도청북부청사", "송산", "영종", "도농", "도심", "양수", "국수", "원덕", "서울(경의중앙선)", "수색", "능곡", "풍산", "운정", "월롱", "신내", "퇴계원", "평내호평", "대성리", "가평", "강촌", "춘천"};
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_setting_des);


        final String Dname=MainActivity.setonOff.getString("desN","없음");
        final TextView tx = (TextView)findViewById(R.id.DesName);
        tx.setText(Dname);

        ArrayAdapter<String> name = new ArrayAdapter<String>(this,
                android.R.layout.simple_dropdown_item_1line, names);

        AutoCompleteTextView auto1 = (AutoCompleteTextView)findViewById(R.id.desid);
        auto1.setAdapter(name);

        auto1.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                CharSequence des=((TextView)view).getText();
                String des1=des.toString();

                MainActivity.editor.putString("desN",des1);
                MainActivity.editor.commit();
                String toastMessage = (des1 + "역으로 설정되었습니다.");
                Toast.makeText(getApplicationContext(), toastMessage, Toast.LENGTH_LONG).show();



                finish();



            }
        });

    }
}
